---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheetType.IsValidMajorLapSplice(System.Double)
source: html/6273ad31-b98a-0dd5-ac36-b7e96e23df00.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.IsValidMajorLapSplice Method

Identifies if the input value is valid to be applied as the major lap splice
 value for this FabricSheetType.

## Syntax (C#)
```csharp
public bool IsValidMajorLapSplice(
	double majorLapSplice
)
```

## Parameters
- **majorLapSplice** (`System.Double`)